OpenFOAM-v1712/tutorials/incompressible/pimpleFoam/LES/vortexShed/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    cylinder
    {
        type            zeroGradient;
    }

    inlet
    {
        type            zeroGradient;
    }

    "outlet|top|bottom"
    {
        type            totalPressure;
        rho             none;
        psi             none;
        p0              $internalField;
        gamma           1;
        value           $internalField;
    }
}


// ************************************************************************* //
